//
//  RegionModel.swift
//  Duriso
//
//  Created by 김동현 on 9/18/24.
//


import Foundation

enum City: String, CaseIterable {
  case seoul = "서울"
  case busan = "부산"
  case daegu = "대구"
  case incheon = "인천"
  case gwangju = "광주"
  case daejeon = "대전"
  case ulsan = "울산"
  case sejong = "세종"
  case gyeonggi = "경기"
  case gangwon = "강원"
  case chungbuk = "충북"
  case chungnam = "충남"
  case jeonbuk = "전북"
  case jeonnam = "전남"
  case gyeongbuk = "경북"
  case gyeongnam = "경남"
  case jeju = "제주"
}

struct District {
  static let districts: [City: [String]] = [
    .seoul: [
      "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구",
      "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구",
      "종로구", "중구", "중랑구"
    ],
    .busan: [
      "강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구",
      "연제구", "영도구", "중구", "해운대구"
    ],
    .daegu: [
      "군위군", "남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"
    ],
    .incheon: [
      "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"
    ],
    .gwangju: [
      "광산구", "남구", "동구", "북구", "서구"
    ],
    .daejeon: [
      "대덕구", "동구", "서구", "유성구", "중구"
    ],
    .ulsan: [
      "남구", "동구", "북구", "울주군", "중구"
    ],
    .sejong: [
      "세종시"
    ],
    .gyeonggi: [
      "가평군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시","동두천시", "부천시",
      "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "양평군", "여주시", "연천군", "오산시",
      "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"
    ],
    .gangwon: [
      "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군",
      "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군"
    ],
    .chungbuk: [
      "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청주시", "충주시"
    ],
    .chungnam: [
      "계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "예산군",
      "천안시", "청양군", "태안군", "홍성군"
    ],
    .jeonbuk: [
      "고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군",
      "전주시", "정읍시", "진안군"
    ],
    .jeonnam: [
      "강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시",
      "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"
    ],
    .gyeongbuk: [
      "경산시", "경주시", "고령군", "구미시", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군",
      "영양군", "영주시", "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시"
    ],
    .gyeongnam: [
      "거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시",
      "창녕군", "창원시", "통영시", "하동군", "함안군", "함양군", "합천군"
    ],
    .jeju: [
      "서귀포시", "제주시"
    ]
  ]
}

struct Town {
  static let towns: [String: [String]] = [
    "서울_강남구": [
      "개포1동", "개포2동", "개포3동", "개포4동", "논현1동", "논현2동", "대치1동", "대치2동", "대치4동", "도곡1동",
      "도곡2동", "삼성1동", "삼성2동", "세곡동", "수서동", "신사동", "압구정동", "역삼1동", "역삼2동", "일원본동",
      "일원1동", "청담동"
    ],
    "서울_강동구": [
      "강일동", "고덕1동", "고덕2동", "길동", "둔촌1동", "둔촌2동", "명일1동", "명일2동", "상일1동", "상일2동",
      "성내1동", "성내2동", "성내3동", "암사1동", "암사2동", "암사3동", "천호1동", "천호2동", "천호3동"
    ],
    "서울_강북구": [
      "미아동", "번1동", "번2동", "번3동", "삼각산동", "삼양동", "송중동", "송천동", "수유1동", "수유2동", "수유3동",
      "우이동", "인수동"
    ],
    "서울_강서구": [
      "가양1동", "가양2동", "가양3동", "공항동", "등촌1동", "등촌2동", "등촌3동", "방화1동", "방화2동", "방화3동",
      "발산1동", "염창동", "화곡1동", "화곡2동", "화곡3동", "화곡4동", "화곡6동", "화곡8동", "화곡본동", "우장산동"
    ],
    "서울_관악구": [
      "낙성대동", "난곡동", "난향동", "남현동", "대학동", "미성동", "보라매동", "삼성동", "서림동", "서원동", "성현동",
      "신림동", "신사동", "신원동", "은천동", "인헌동", "조원동", "중앙동", "청룡동", "청림동", "행운동"
    ],
    "서울_광진구": [
      "광장동", "구의1동", "구의2동", "구의3동", "군자동", "능동", "자양1동", "자양2동", "자양3동", "자양4동",
      "중곡1동", "중곡2동", "중곡3동", "중곡4동", "화양동"
    ],
    "서울_구로구": [
      "가리봉동", "개봉1동", "개봉2동", "개봉3동", "고척1동", "고척2동", "구로1동", "구로2동", "구로3동", "구로4동",
      "구로5동", "신도림동", "오류1동", "오류2동", "항동", "수궁동"
    ],
    "서울_금천구": [
      "가산동", "독산1동", "독산2동", "독산3동", "독산4동", "시흥1동", "시흥2동", "시흥3동", "시흥4동", "시흥5동"
    ],
    "서울_노원구": [
      "공릉1동", "공릉2동", "상계10동", "상계1동", "상계2동", "상계3.4동", "상계5동", "상계6.7동", "상계8동",
      "상계9동", "월계1동", "월계2동", "월계3동", "중계1동", "중계2.3동", "중계4동", "중계본동", "하계1동", "하계2동"
    ],
    "서울_도봉구": [
      "도봉1동", "도봉2동", "방학1동", "방학2동", "방학3동", "쌍문1동", "쌍문2동", "쌍문3동", "쌍문4동", "창1동",
      "창2동", "창3동", "창4동", "창5동"
    ],
    "서울_동대문구": [
      "답십리1동", "답십리2동", "용신동", "이문1동", "이문2동", "장안1동", "장안2동", "전농1동", "전농2동", "제기동",
      "청량리동", "회기동", "휘경1동", "휘경2동"
    ],
    "서울_동작구": [
      "노량진1동", "노량진2동", "대방동", "사당1동", "사당2동", "사당3동", "사당4동", "사당5동", "상도1동", "상도2동",
      "상도3동", "상도4동", "신대방1동", "신대방2동", "흑석동"
    ],
    "서울_마포구": [
      "공덕동", "대흥동", "도화동", "망원1동", "망원2동", "상암동", "서강동", "서교동", "성산1동", "성산2동", "신수동",
      "아현동", "연남동", "염리동", "용강동", "합정동"
    ],
    "서울_서대문구": [
      "남가좌1동", "남가좌2동", "북가좌1동", "북가좌2동", "북아현동", "신촌동", "연희동", "천연동", "충현동", "홍은1동",
      "홍은2동", "홍제1동", "홍제2동", "홍제3동"
    ],
    "서울_서초구": [
      "내곡동", "반포1동", "반포2동", "반포3동", "반포4동", "반포본동", "방배1동", "방배2동", "방배3동", "방배4동",
      "방배본동", "서초1동", "서초2동", "서초3동", "서초4동", "양재1동", "양재2동", "잠원동"
    ],
    "서울_성동구": [
      "금호1가동", "금호2.3가동", "금호4가동", "마장동", "사근동", "성수1가1동", "성수1가2동", "성수2가1동",
      "성수2가3동", "송정동", "옥수동", "왕십리2동", "왕십리도선동", "용답동", "응봉동", "행당1동", "행당2동"
    ],
    "서울_성북구": [
      "길음1동", "길음2동", "돈암1동", "돈암2동", "동선동", "보문동", "삼선동", "석관동", "성북동", "안암동",
      "월곡1동", "월곡2동", "장위1동", "장위2동", "장위3동", "정릉1동", "정릉2동", "정릉3동", "정릉4동", "종암동"
    ],
    "서울_송파구": [
      "가락1동", "가락2동", "가락본동", "거여1동", "거여2동", "마천1동", "마천2동", "문정1동", "문정2동", "방이1동",
      "방이2동", "삼전동", "석촌동", "송파1동", "송파2동", "오금동", "오륜동", "위례동", "잠실2동", "잠실3동",
      "잠실4동", "잠실6동", "잠실7동", "잠실본동", "장지동", "풍납1동", "풍납2동"
    ],
    "서울_양천구": [
      "목1동", "목2동", "목3동", "목4동", "목5동", "신월1동", "신월2동", "신월3동", "신월4동", "신월5동", "신월6동",
      "신월7동", "신정1동", "신정2동", "신정3동", "신정4동", "신정6동", "신정7동"
    ],
    "서울_영등포구": [
      "당산1동", "당산2동", "대림1동", "대림2동", "대림3동", "도림동", "문래동", "신길1동", "신길3동", "신길4동",
      "신길5동", "신길6동", "신길7동", "양평1동", "양평2동", "여의동", "영등포동", "영등포본동"
    ],
    "서울_용산구": [
      "남영동", "보광동", "서빙고동", "용문동", "용산2가동", "원효로1동", "원효로2동", "이촌1동", "이촌2동",
      "이태원1동", "이태원2동", "청파동", "한강로동", "한남동", "효창동", "후암동"
    ],
    "서울_은평구": [
      "갈현1동", "갈현2동", "구산동", "녹번동", "대조동", "불광1동", "불광2동", "수색동", "신사1동", "신사2동",
      "역촌동", "응암1동", "응암2동", "응암3동", "증산동", "진관동"
    ],
    "서울_종로구": [
      "가회동", "교남동", "무악동", "부암동", "사직동", "삼청동", "숭인1동", "숭인2동", "이화동", "종로1.2.3.4가동",
      "종로5.6가동", "창신1동", "창신2동", "창신3동", "청운효자동", "평창동", "혜화동"
    ],
    "서울_중구": [
      "광희동", "다산동", "명동", "묵정동", "소공동", "신당5동", "신당동", "약수동", "을지로동", "장충동", "중림동",
      "청구동", "필동", "황학동", "회현동"
    ],
    "서울_중랑구": [
      "망우3동", "망우본동", "면목2동", "면목3.8동", "면목4동", "면목5동", "면목7동", "면목본동", "묵1동", "묵2동", 
      "상봉1동", "상봉2동", "신내1동", "신내2동", "중화1동", "중화2동"
    ],
    
    "부산_강서구": [
      "가덕도동", "가락동", "대저1동", "대저2동", "녹산동", "명지1동", "명지2동", "강동동"
    ],
    "부산_금정구": [
      "구서1동", "구서2동", "금성동", "금사회동동", "남산동", "부곡1동", "부곡2동", "부곡3동", "부곡4동", "서1동", 
      "서2동", "서3동", "선두구동", "장전1동", "장전2동", "청룡노포동"
    ],
    "부산_기장군": [
      "기장읍", "일광읍", "장안읍", "정관읍", "철마면"
    ],
    "부산_남구": [
      "감만1동", "감만2동", "대연1동", "대연3동", "대연4동", "대연5동", "대연6동", "문현1동", "문현2동", "문현3동", 
      "문현4동", "용당동", "용호1동", "용호2동", "용호3동", "용호4동", "우암동"
    ],
    "부산_동구": [
      "범일1동", "범일2동", "범일5동", "수정1동", "수정2동", "수정4동", "수정5동", "좌천동", "초량1동", "초량2동", 
      "초량3동", "초량6동"
    ],
    "부산_동래구": [
      "명륜동", "명장1동", "명장2동", "복산동", "사직1동", "사직2동", "사직3동", "수민동", "안락1동", "안락2동",
      "온천1동", "온천2동", "온천3동"
    ],
    "부산_부산진구": [
      "가야1동", "가야2동", "개금1동", "개금2동", "개금3동", "당감1동", "당감2동", "당감4동", "범천1동", "범천2동", 
      "부암1동", "부암3동", "부전1동", "부전2동", "양정1동", "양정2동", "연지동", "전포1동", "전포2동", "초읍동"
    ],
    "부산_북구": [
      "구포1동", "구포2동", "구포3동", "금곡동", "덕천1동", "덕천2동", "덕천3동", "만덕1동", "만덕2동", "만덕3동", 
      "화명1동", "화명2동", "화명3동"
    ],
    "부산_사상구": [
      "감전동", "괘법동", "덕포1동", "덕포2동", "모라1동", "모라3동", "삼락동", "엄궁동", "주례1동", "주례2동", 
      "주례3동", "학장동"
    ],
    "부산_사하구": [
      "감천1동", "감천2동", "괴정1동", "괴정2동", "괴정3동", "괴정4동", "구평동", "다대1동", "다대2동", "당리동", 
      "신평1동", "신평2동", "장림1동", "장림2동", "하단1동", "하단2동"
    ],
    "부산_서구": [
      "남부민1동", "남부민2동", "동대신1동", "동대신2동", "동대신3동", "부민동", "서대신1동", "서대신3동", "서대신4동", 
      "아미동", "암남동", "초장동", "충무동"
    ],
    "부산_수영구": [
      "광안1동", "광안2동", "광안3동", "광안4동", "남천1동", "남천2동", "망미1동", "망미2동", "민락동", "수영동"
    ],
    "부산_연제구": [
      "거제1동", "거제2동", "거제3동", "거제4동", "연산1동", "연산2동", "연산3동", "연산4동", "연산5동", "연산6동", 
      "연산8동", "연산9동"
    ],
    "부산_영도구": [
      "남항동", "동삼1동", "동삼2동", "동삼3동", "봉래1동", "봉래2동", "신선동", "영선1동", "영선2동", "청학1동", 
      "청학2동"
    ],
    "부산_중구": [
      "광복동", "남포동", "대청동", "동광동", "보수동", "부평동", "신창동", "중앙동", "창선동"
    ],
    "부산_해운대구": [
      "반송1동", "반송2동", "반여1동", "반여2동", "반여3동", "반여4동", "송정동", "우1동", "우2동", "우3동",
      "재송1동", "재송2동", "좌1동", "좌2동", "좌3동", "좌4동", "중1동", "중2동"
    ],
    
    "대구_군위군": [
      "군위읍", "부계면", "산성면", "삼국유사면", "소보면", "우보면", "의흥면", "효령면"
    ],
    "대구_남구": [
      "대명1동", "대명10동", "대명11동", "대명2동", "대명3동", "대명4동", "대명5동", "대명6동", "대명9동", "봉덕1동",
      "봉덕2동", "봉덕3동", "이천동"
    ],
    "대구_달서구": [
      "감삼동", "도원동", "두류1.2동", "두류3동", "본동", "본리동", "상인1동", "상인2동", "상인3동", "성당동",
      "송현1동", "송현2동", "신당동", "용산1동", "용산2동", "유천동", "월성1동", "월성2동", "이곡1동", "이곡2동",
      "장기동", "죽전동", "진천동"
    ],
    "대구_달성군": [
      "가창면", "구지면", "논공읍", "다사읍", "옥포읍", "유가읍", "현풍읍", "하빈면", "화원읍"
    ],
    "대구_동구": [
      "공산동", "도평동", "동촌동", "방촌동", "불로봉무동", "신암1동", "신암2동", "신암3동", "신암4동", "신암5동",
      "신천1.2동", "신천3동", "신천4동", "안심1동", "안심2동", "안심3동", "안심4동", "지저동", "해안동", "혁신동",
      "효목1동", "효목2동"
    ],
    "대구_북구": [
      "검단동", "고성동", "구암동", "국우동", "관음동", "관문동", "노원동", "대현동", "동천동", "무태조야동", "복현1동",
      "복현2동", "산격1동", "산격2동", "산격3동", "산격4동", "읍내동", "칠성동", "침산1동", "침산2동", "침산3동",
      "태전1동", "태전2동"
    ],
    "대구_서구": [
      "내당1동", "내당2.3동", "내당4동", "비산1동", "비산2.3동", "비산4동", "비산5동", "비산6동", "비산7동",
      "상중이동", "원대동", "평리1동", "평리2동", "평리3동", "평리4동", "평리5동", "평리6동"
    ],
    "대구_수성구": [
      "고산1동", "고산2동", "고산3동", "두산동", "만촌1동", "만촌2동", "만촌3동", "범물1동", "범물2동", "범어1동",
      "범어2동", "범어3동", "범어4동", "상동", "수성1가동", "수성2.3가동", "수성4가동", "중동", "지산1동", "지산2동",
      "파동", "황금1동", "황금2동"
    ],
    "대구_중구": [
      "대봉1동", "대봉2동", "남산1동", "남산2동", "남산3동", "남산4동", "대신동", "동인동", "삼덕동", "성내1동",
      "성내2동", "성내3동"
    ],
    
    "인천_강화군": [
      "강화읍", "교동면", "길상면", "내가면", "불은면", "삼산면", "서도면", "선원면", "송해면", "양도면", "양사면",
      "하점면", "화도면"
    ],
    "인천_계양구": [
      "계산1동", "계산2동", "계산3동", "계산4동", "계양1동", "계양2동", "계양3동", "작전1동", "작전2동", "작전서운동",
      "효성1동", "효성2동"
    ],
    "인천_남동구": [
      "간석1동", "간석2동", "간석3동", "간석4동", "구월1동", "구월2동", "구월3동", "구월4동", "남촌도림동", "논현1동",
      "논현2동", "논현고잔동", "만수1동", "만수2동", "만수3동", "만수4동", "만수5동", "만수6동", "서창2동",
      "장수서창동"
    ],
    "인천_동구": [
      "금창동", "만석동", "송림1동", "송림2동", "송림3.5동", "송림4동", "송림6동", "송현1.2동", "송현3동", 
      "화수1.화평동", "화수2동"
    ],
    "인천_미추홀구": [
      "관교동", "도화1동", "도화2.3동", "문학동", "숭의1.3동", "숭의2동", "숭의4동", "용현1.4동", "용현2동",
      "용현3동", "용현5동", "주안1동", "주안2동", "주안3동", "주안4동", "주안5동", "주안6동", "주안7동", "주안8동",
      "학익1동", "학익2동"
    ],
    "인천_부평구": [
      "갈산1동", "갈산2동", "부개1동", "부개2동", "부개3동", "부평1동", "부평2동", "부평3동", "부평4동", "부평5동",
      "부평6동", "산곡1동", "산곡2동", "산곡3동", "산곡4동", "삼산1동", "삼산2동", "십정1동", "십정2동", "일신동",
      "청천1동", "청천2동"
    ],
    "인천_서구": [
      "가정1동", "가정2동", "가정3동", "가좌1동", "가좌2동", "가좌3동", "가좌4동", "검암경서동", "검단동", "당하동",
      "마전동", "불로대곡동", "석남1동", "석남2동", "석남3동", "신현원창동", "아라동", "연희동", "오류왕길동", "원당동",
      "청라1동", "청라2동", "청라3동"
    ],
    "인천_연수구": [
      "동춘1동", "동춘2동", "동춘3동", "송도1동", "송도2동", "송도3동", "송도4동", "송도5동", "선학동", "연수1동",
      "연수2동", "연수3동", "옥련1동", "옥련2동", "청학동"
    ],
    "인천_옹진군": [
      "대청면", "덕적면", "백령면", "북도면", "연평면", "영흥면", "자월면"
    ],
    "인천_중구": [
      "개항동", "도원동", "동인천동", "연안동", "영종1동", "영종동", "용유동", "율목동", "운서동", "신포동", "신흥동"
    ],
    
    "광주_광산구": [
      "도산동", "동곡동", "본량동", "비아동", "삼도동", "송정1동", "송정2동", "수완동", "신가동", "신창동", "신흥동",
      "어룡동", "우산동", "운남동", "월곡1동", "월곡2동", "임곡동", "평동", "하남동", "첨단1동", "첨단2동"
    ],
    "광주_남구": [
      "대촌동", "방림1동", "방림2동", "백운1동", "백운2동", "봉선1동", "봉선2동", "사직동", "송암동", "양림동",
      "월산동", "월산4동", "월산5동", "주월1동", "주월2동", "진월동", "효덕동"
    ],
    "광주_동구": [
      "계림1동", "계림2동", "동명동", "산수1동", "산수2동", "서남동", "지산1동", "지산2동", "지원1동", "지원2동",
      "충장동", "학동", "학운동"
    ],
    "광주_북구": [
      "건국동", "동림동", "두암1동", "두암2동", "두암3동", "매곡동", "문화동", "문흥1동", "문흥2동", "삼각동",
      "석곡동", "신안동", "신용동", "양산동", "오치1동", "오치2동", "용봉동", "우산동", "운암1동", "운암2동",
      "운암3동", "일곡동", "임동", "중앙동", "중흥1동", "중흥2동", "중흥3동", "풍향동"
    ],
    "광주_서구": [
      "광천동", "금호1동", "금호2동", "농성1동", "농성2동", "동천동", "상무1동", "상무2동", "서창동",
      "양동", "양3동", "유덕동", "치평동", "풍암동", "화정1동", "화정2동", "화정3동", "화정4동"
    ],
    
    "대전_대덕구": [
      "덕암동", "대화동", "목상동", "법1동", "법2동", "비래동", "석봉동", "송촌동", "신탄진동", "오정동", "중리동",
      "회덕동"
    ],
    "대전_동구": [
      "가양1동", "가양2동", "대동", "대청동", "산내동", "삼성동", "성남동", "신인동", "용운동", "용전동", "자양동",
      "중앙동", "판암1동", "판암2동", "홍도동", "효동"
    ],
    "대전_서구": [
      "가수원동", "가장동", "갈마1동", "갈마2동", "관저1동", "관저2동", "괴정동", "기성동", "내동", "도마1동",
      "도마2동", "도안동", "둔산1동", "둔산2동", "둔산3동", "만년동", "변동", "복수동", "용문동", "월평1동",
      "월평2동", "월평3동", "정림동", "탄방동"
    ],
    "대전_유성구": [
      "구즉동", "관평동", "노은1동", "노은2동", "노은3동", "상대동", "신성동", "온천1동", "온천2동", "원신흥동",
      "전민동", "진잠동", "학하동"
    ],
    "대전_중구": [
      "대사동", "대흥동", "목동", "문창동", "문화1동", "문화2동", "부사동", "산성동", "석교동", "오류동", "용두동",
      "유천1동", "유천2동", "은행선화동", "중촌동", "태평1동", "태평2동"
    ],
    
    "울산_남구": [
      "달동", "대현동", "무거동", "삼산동", "삼호동", "선암동", "수암동", "신정1동", "신정2동", "신정3동", "신정4동",
      "신정5동", "야음장생포동", "옥동"
    ],
    "울산_동구": [
      "남목1동", "남목2동", "남목3동", "대송동", "방어동", "일산동", "전하1동", "전하2동", "화정동"
    ],
    "울산_북구": [
      "강동동", "농소1동", "농소2동", "농소3동", "송정동", "양정동", "염포동", "효문동"
    ],
    "울산_울주군": [
      "두동면", "두서면", "범서읍", "삼남읍", "삼동면", "상북면", "서생면", "언양읍", "온산읍", "온양읍", "웅촌면",
      "청량읍"
    ],
    "울산_중구": [
      "다운동", "반구1동", "반구2동", "병영1동", "병영2동", "복산1동", "복산2동", "성안동", "약사동", "우정동",
      "중앙동", "태화동", "학성동"
    ],
    
    "세종_세종시": [
      "고운동", "금남면", "나성동", "다정동", "대평동", "도담동", "반곡동", "보람동", "부강면", "새롬동", "소담동",
      "소정면", "아름동", "어진동", "연기면", "연동면", "연서면", "장군면", "전동면", "전의면", "조치원읍", "종촌동",
      "한솔동", "해밀동"
    ],
    
    "경기_가평군": [
      "가평읍", "북면", "상면", "설악면", "조종면", "청평면"
    ],
    "경기_고양시": [
      "덕양구", "일산동구", "일산서구"
    ],
    "경기_과천시": [
      "갈현동", "과천동", "문원동", "별양동", "부림동", "원문동", "중앙동"
    ],
    "경기_광명시": [
      "광명1동", "광명2동", "광명3동", "광명4동", "광명5동", "광명6동", "광명7동", "소하1동", "소하2동", "일직동",
      "철산1동", "철산2동", "철산3동", "철산4동", "하안1동", "하안2동", "하안3동", "하안4동", "학온동"
    ],
    "경기_광주시": [
      "경안동", "곤지암읍", "광남1동", "광남2동", "남종면", "남한산성면", "능평동", "도척면", "송정동", "신현동",
      "쌍령동", "오포1동", "오포2동", "초월읍", "탄벌동", "퇴촌면"
    ],
    "경기_구리시": [
      "갈매동", "교문1동", "교문2동", "동구동", "수택1동", "수택2동", "수택3동", "인창동"
    ],
    "경기_군포시": [
      "광정동", "군포1동", "군포2동", "궁내동", "금정동", "대야동", "산본1동", "산본2동", "송부동", "수리동", "오금동",
      "재궁동"
    ],
    "경기_김포시": [
      "고촌읍", "구래동", "김포본동", "대곶면", "마산동", "사우동", "양촌읍", "운양동", "월곶면", "장기동", "장기본동",
      "통진읍", "풍무동", "하성면"
    ],
    "경기_남양주시": [
      "금곡동", "다산1동", "다산2동", "별내동", "별내면", "수동면", "양정동", "오남읍", "와부읍", "조안면", "진건읍",
      "진접읍", "퇴계원읍", "평내동", "호평동", "화도읍"
    ],
    "경기_동두천시": [
      "보산동", "불현동", "상패동", "생연1동", "생연2동", "소요동", "송내동", "중앙동"
    ],
    "경기_부천시": [
      "대산동", "범안동", "부천동", "상동", "성곡동", "소사본동", "신중동", "심곡동", "오정동", "중동"
    ],
    "경기_성남시": [
      "분당구", "수정구", "중원구"
    ],
    "경기_수원시": [
      "권선구", "영통구", "장안구", "팔달구"
    ],
    "경기_시흥시": [
      "거북섬동", "과림동", "군자동", "능곡동", "대야동", "매화동", "목감동", "배곧1동", "배곧2동", "신천동", "신현동",
      "연성동", "월곶동", "은행동", "장곡동", "정왕1동", "정왕2동", "정왕3동", "정왕4동", "정왕본동"
    ],
    "경기_안산시": [
      "단원구", "상록구"
    ],
    "경기_안성시": [
      "고삼면", "공도읍", "금광면", "대덕면", "미양면", "보개면", "삼죽면", "서운면", "안성1동", "안성2동", "안성3동",
      "양성면", "원곡면", "일죽면", "죽산면"
    ],
    "경기_안양시": [
      "동안구", "만안구"
    ],
    "경기_양주시": [
      "광적면", "남면", "백석읍", "양주1동", "양주2동", "옥정1동", "옥정2동", "은현면", "장흥면", "회천1동",
      "회천2동", "회천3동"
    ],
    "경기_양평군": [
      "강상면", "강하면", "개군면", "단월면", "서종면", "양동면", "양서면", "양평읍", "옥천면", "용문면", "지평면",
      "청운면"
    ],
    "경기_여주시": [
      "가남읍", "강천면", "금사면", "대신면", "북내면", "산북면", "세종대왕면", "여흥동", "오학동", "점동면", "중앙동",
      "흥천면"
    ],
    "경기_연천군": [
      "군남면", "미산면", "백학면", "신서면", "연천읍", "왕징면", "장남면", "전곡읍", "중면", "청산면"
    ],
    "경기_오산시": [
      "남촌동", "대원동", "세마동", "신장동", "중앙동", "초평동"
    ],
    "경기_용인시": [
      "기흥구", "수지구", "처인구"
    ],
    "경기_의왕시": [
      "고천동", "내손1동", "내손2동", "부곡동", "오전동", "청계동"
    ],
    "경기_의정부시": [
      "가능동", "녹양동", "송산1동", "송산2동", "송산3동", "신곡1동", "신곡2동", "의정부1동", "의정부2동", "자금동",
      "장암동", "호원1동", "호원2동", "흥선동"
    ],
    "경기_이천시": [
      "관고동", "대월면", "마장면", "모가면", "백사면", "부발읍", "설성면", "신둔면", "율면", "장호원읍", "중리동",
      "증포동", "창전동", "호법면"
    ],
    "경기_파주시": [
      "광탄면", "교하동", "군내면", "금촌1동", "금촌2동", "금촌3동", "문산읍", "법원읍", "운정1동", "운정2동",
      "운정3동", "운정4동", "운정5동", "운정6동", "월롱면", "장단면", "적성면", "조리읍", "진동면", "진서면", "탄현면",
      "파주읍", "파평면"
    ],
    "경기_평택시": [
      "고덕동", "고덕면", "동삭동", "비전1동", "비전2동", "서정동", "서탄면", "세교동", "송북동", "송탄동", "신장1동",
      "신장2동", "신평동", "안중읍", "오성면", "용이동", "원평동", "중앙동", "지산동", "진위면", "청북읍", "통복동",
      "팽성읍", "포승읍", "현덕면"
    ],
    "경기_포천시": [
      "가산면", "관인면", "군내면", "내촌면", "선단동", "소흘읍", "신북면", "영북면", "영중면", "이동면", "일동면",
      "창수면", "포천동", "화현면"
    ],
    "경기_하남시": [
      "감북동", "감일동", "덕풍1동", "덕풍2동", "덕풍3동", "미사1동", "미사2동", "미사3동", "신장1동", "신장2동",
      "위례동", "천현동", "초이동", "춘궁동"
    ],
    "경기_화성시": [
      "기배동", "남양읍", "동탄1동", "동탄2동", "동탄3동", "동탄4동", "동탄5동", "동탄6동", "동탄7동", "동탄8동",
      "동탄9동", "마도면", "매송면", "반월동", "병점1동", "병점2동", "봉담읍", "비봉면", "새솔동", "서신면", "송산면",
      "양감면", "우정읍", "장안면", "정남면", "진안동", "팔탄면", "향남읍", "화산동"
    ],
    
    "강원_강릉시": [
      "강남동", "강동면", "경포동", "교1동", "교2동", "구정면", "내곡동", "사천면", "성덕동", "성산면", "송정동",
      "연곡면", "옥계면", "옥천동", "왕산면", "주문진읍", "중앙동", "초당동", "포남1동", "포남2동", "홍제동"
    ],
    "강원_고성군": [
      "간성읍", "거진읍", "수동면", "죽왕면", "토성면", "현내면"
    ],
    "강원_동해시": [
      "동호동", "망상동", "묵호동", "발한동", "부곡동", "북삼동", "북평동", "삼화동", "송정동", "천곡동"
    ],
    "강원_삼척시": [
      "가곡면", "교동", "근덕면", "남양동", "노곡면", "도계읍", "미로면", "성내동", "신기면", "원덕읍", "정라동",
      "하장면"
    ],
    "강원_속초시": [
      "교동", "금호동", "노학동", "대포동", "동명동", "영랑동", "조양동", "청호동"
    ],
    "강원_양구군": [
      "국토정중앙면", "동면", "방산면", "양구읍", "해안면"
    ],
    "강원_양양군": [
      "강현면", "서면", "손양면", "양양읍", "현남면", "현북면"
    ],
    "강원_영월군": [
      "김삿갓면", "남면", "무릉도원면", "북면", "산솔면", "상동읍", "영월읍", "주천면", "한반도면"
    ],
    "강원_원주시": [
      "개운동", "귀래면", "단계동", "단구동", "명륜1동", "명륜2동", "무실동", "문막읍", "반곡관설동", "봉산동",
      "부론면", "소초면", "신림면", "우산동", "원인동", "일산동", "중앙동", "지정면", "태장1동", "태장2동", "판면",
      "학성동", "행구동", "호저면", "홍업면"
    ],
    "강원_인제군": [
      "기린면", "남면", "북면", "상남면", "서화면", "인제읍"
    ],
    "강원_정선군": [
      "고한읍", "남면", "북평면", "사북읍", "신동읍", "여량면", "임계면", "정선읍", "화암면"
    ],
    "강원_철원군": [
      "갈말읍", "근남면", "근동면", "근북면", "김화읍", "동송읍", "서면", "원남면", "원동면", "임남면", "철원읍"
    ],
    "강원_춘천시": [
      "강남동", "교동", "근화동", "남면", "남산면", "동내면", "동면", "동산면", "북산면", "사북면", "서면", "석사동",
      "소양동", "신동면", "신북읍", "신사우동", "약사명동", "조운동", "퇴계동", "효자1동", "효자2동", "효자3동",
      "후평1동", "후평2동", "후평3동"
    ],
    "강원_태백시": [
      "구문소동", "문곡소도동", "삼수동", "상장동", "장성동", "철암동", "황연동", "황지동"
    ],
    "강원_평창군": [
      "대관령면", "대화면", "미탄면", "방림면", "봉평면", "용평면", "진부면", "평창읍"
    ],
    "강원_홍천군": [
      "남면", "내면", "내촌면", "두촌면", "북방면", "서면", "서석면", "영귀미면", "홍천읍", "화촌면"
    ],
    "강원_화천군": [
      "간동면", "사내면", "상서면", "하남면", "화천읍"
    ],
    "강원_횡성군": [
      "갑천면", "강림면", "공근면", "둔내면", "서원면", "안홍면", "우천면", "청일면", "횡성읍"
    ],
    
    "충북_괴산군": [
      "감물면", "괴산읍", "문광면", "불정면", "사리면", "소수면", "연풍면", "장연면", "청안면", "청천면", "칠성면"
    ],
    "충북_단양군": [
      "가곡면", "단성면", "단양읍", "대강면", "매포읍", "어상천면", "영춘면", "적성면"
    ],
    "충북_보은군": [
      "내북면", "마로면", "보은읍", "산외면", "삼승면", "속리산면", "수한면", "장안면", "탄부면", "회남면", "회인면"
    ],
    "충북_영동군": [
      "매곡면", "상촌면", "심천면", "양강면", "양산면", "영동읍", "용산면", "용화면", "추풍령면", "학산면", "황간면"
    ],
    "충북_옥천군": [
      "군북면", "군서면", "동이면", "안남면", "안내면", "옥천읍", "이원면", "청산면", "청성면"
    ],
    "충북_음성군": [
      "감곡면", "금왕읍", "대소면", "맹동면", "삼성면", "생극면", "소이면", "원남면", "음성읍"
    ],
    "충북_제천시": [
      "교동", "금성면", "남현동", "덕산면", "백운면", "봉양읍", "송학면", "수산면", "신백동", "영서동", "용두동",
      "의림지동", "중앙동", "청전동", "청풍면", "한수면", "화산동"
    ],
    "충북_증평군": [
      "도안면", "증평읍"
    ],
    "충북_진천군": [
      "광혜원면", "덕산읍", "문백면", "백곡면", "이월면", "진천읍", "초평면"
    ],
    "충북_청주시": [
      "상당구", "서원구", "청원구", "흥덕구"
    ],
    "충북_충주시": [
      "교현.안림동", "교현2동", "금가면", "노은면", "달천동", "대소원면", "동량면", "목행.용탄동", "문화동", "봉방동",
      "산척면", "살미면", "성내.충인동", "소태면", "수안보면", "신니면", "앙성면", "엄정면", "연수동", "용산동",
      "주덕읍", "중앙탑면", "지현동", "칠금.금릉동", "호함.직동"
    ],
    
    "충남_계룡시": [
      "금암동", "두마면", "신도안면", "엄사면"
    ],
    "충남_공주시": [
      "계룡면", "금학동", "반포면", "사곡면", "신관동", "신풍면", "옥룡동", "우성면", "웅진동", "월송동", "유구읍",
      "의당면", "이인면", "정안면", "중학동", "탄천면"
    ],
    "충남_금산군": [
      "군북면", "금산읍", "금성면", "남이면", "남일면", "복수면", "부리면", "제원면", "진산면", "추부면"
    ],
    "충남_논산시": [
      "가야곡면", "강경읍", "광석면", "노성면", "벌곡면", "부적면", "부창동", "상월면", "성동면", "양촌면", "연무읍",
      "연산면", "은진면", "채운면", "취암동"
    ],
    "충남_당진시": [
      "고대면", "당진1동", "당진2동", "당진3동", "대호지면", "면천면", "석문면", "송산면", "송악읍", "순성면",
      "신평면", "우강면", "정미면", "합덕읍"
    ],
    "충남_보령시": [
      "남포면", "대천1동", "대천2동", "대천3동", "대천4동", "대천5동", "미산면", "성주면", "오천면", "웅천읍",
      "주교면", "주산면", "주포면", "천북면", "청라면", "청소면"
    ],
    "충남_부여군": [
      "구룡면", "규암면", "남면", "내산면", "부여읍", "석성면", "세도면", "양화면", "옥산면", "외산면", "은산면",
      "임천면", "장암면", "초촌면", "충화면", "홍산면"
    ],
    "충남_서산시": [
      "고북면", "대산읍", "동문1동", "동문2동", "부석면", "부춘동", "석남동", "성연면", "수석동", "운산면", "음암면",
      "인지면", "지곡면", "팔봉면", "해미면"
    ],
    "충남_서천군": [
      "기산면", "마산면", "마서면", "문산면", "비인면", "서면", "서천읍", "시초면", "장항읍", "종천면", "판교면", 
      "한산면", "화양면"
    ],
    "충남_아산시": [
      "도고면", "둔포면", "배방읍", "선장면", "송악면", "신창면", "염치읍", "영인면", "온양1동", "온양2동", "온양3동",
      "온양4동", "온양5동", "온양6동", "음봉면", "인주면", "탕정면"
    ],
    "충남_예산군": [
      "고덕면", "광시면", "대술면", "대흥면", "덕산면", "봉산면", "삽교읍", "신암면", "신양면", "예산읍", "오가면",
      "응봉면"
    ],
    "충남_천안시": [
      "동남구", "서북구"
    ],
    "충남_청양군": [
      "남양면", "대치면", "목면", "비봉면", "운곡면", "장평면", "정산면", "청남면", "청양읍", "화성면"
    ],
    "충남_태안군": [
      "고남면", "근흥면", "남면", "소원면", "안면읍", "원북면", "이원면", "태안읍"
    ],
    "충남_홍성군": [
      "갈산면", "결성면", "광천읍", "구항면", "금마면", "서부면", "은하면", "장곡면", "홍동면", "홍북읍", "홍성읍"
    ],
    
    "전북_고창군": [
      "고수면", "고창읍", "공음면", "대산면", "무장면", "부안면", "상하면", "성내면", "성송면", "신림면", "심원면",
      "아산면", "해리면", "흥덕면"
    ],
    "전북_군산시": [
      "개정동", "개정면", "경암동", "구암동", "나운1동", "나운2동", "나운3동", "나포면", "대야면", "미성동", "삼학동",
      "서수면", "성산면", "소룡동", "수송동", "신풍동", "옥구읍", "옥도면", "옥산면", "옥서면", "월명동", "임피면",
      "조촌동", "중앙동", "해신동", "회현면", "흥남동"
    ],
    "전북_김제시": [
      "검산동", "공덕면", "광활면", "교월동", "금구면", "금산면", "만경읍", "백구면", "백산면", "봉남면", "부량면",
      "성덕면", "신풍동", "요촌동", "용지면", "죽산면", "진봉면", "청하면", "황산면"
    ],
    "전북_남원시": [
      "금동", "금지면", "노암동", "대강면", "대산면", "덕과면", "도통동", "동충동", "보절면", "사매면", "산내면",
      "산동면", "송동면", "수지면", "아영면", "왕정동", "운봉읍", "이백면", "인월면", "주생면", "주천면", "죽항동",
      "향교동"
    ],
    "전북_무주군": [
      "무주읍", "무풍면", "부남면", "설천면", "안성면", "적상면"
    ],
    "전북_부안군": [
      "계화면", "동진면", "백산면", "변산면", "보안면", "부안읍", "상서면", "위도면", "주산면", "줄포면", "진서면",
      "하서면", "행안면"
    ],
    "전북_순창군": [
      "구림면", "금과면", "동계면", "복흥면", "순창읍", "쌍치면", "유등면", "인계면", "적성면", "팔덕면", "풍산면"
    ],
    "전북_완주군": [
      "경천면", "고산면", "구이면", "동상면", "봉동읍", "비봉면", "삼례읍", "상관면", "소양면", "용진읍", "운주면",
      "이서면", "화산면"
    ],
    "전북_익산시": [
      "감기면", "금마면", "남중동", "낭산면", "동산동", "마동", "망성면", "모현동", "삼성동", "성당면", "송학동",
      "신동", "어양동", "여산면", "영등1동", "영등2동", "오산면", "왕궁면", "용동면", "용안면", "웅포면", "인화동",
      "중앙동", "춘포면", "팔봉동", "평화동", "함라면", "함열읍", "황등면"
    ],
    "전북_임실군": [
      "강진면", "관촌면", "덕치면", "삼계면", "성수면", "신덕면", "신평면", "오수면", "운암면", "임실읍", "지사면",
      "청웅면"
    ],
    "전북_장수군": [
      "계남면", "계북면", "번암면", "산서면", "장계면", "장수읍", "천천면"
    ],
    "전북_전주시": [
      "완산구", "덕진구"
    ],
    "전북_정읍시": [
      "감곡면", "고부면", "내장상동", "농소동", "덕천면", "북면", "산내면", "산외면", "상교동", "소성면", "수성동",
      "시기동", "신태인읍", "연지동", "영원면", "옹동면", "이평면", "입암면", "장명동", "정우면", "초산동", "칠보면",
      "태인면"
    ],
    "전북_진안군": [
      "동향면", "마령면", "백운면", "부귀면", "상전면", "성수면", "안천면", "용담면", "정천면", "주천면", "진안읍"
    ],

    "전남_강진군": [
      "강진읍", "군동면", "대구면", "도암면", "마량면", "병영면", "성전면", "신전면", "옴천면", "작천면", "칠량면"
    ],
    "전남_고흥군": [
      "고흥읍", "과역면", "금산면", "남양면", "대서면", "도덕면", "도양읍", "도화면", "동강면", "동일면", "두원면",
      "봉래면", "영남면", "점암면", "포두면", "풍양면"
    ],
    "전남_곡성군": [
      "겸면", "고달면", "곡성읍", "목사동면", "삼기면", "석곡면", "오곡면", "오산면", "옥과면", "입면", "죽곡면"
    ],
    "전남_광양시": [
      "골약동", "광양읍", "광영동", "금호동", "다압면", "봉강면", "옥곡면", "옥룡면", "중마동", "진상면", "진월면",
      "태인동"
    ],
    "전남_구례군": [
      "간전면", "광의면", "구례읍", "마산면", "문척면", "산동면", "용방면", "토지면"
    ],
    "전남_나주시": [
      "공산면", "금남동", "금천면", "남평읍", "노안면", "다도면", "다시면", "동강면", "문평면", "반남면", "봉황면",
      "빛가람동", "산포면", "성북동", "세지면", "송월동", "영강동", "영산동", "왕곡면", "이창동"
    ],
    "전남_담양군": [
      "가사문학면", "고서면", "금성면", "담양읍", "대덕면", "대전면", "무정면", "봉산면", "수북면", "용면", "월산면",
      "창평면"
    ],
    "전남_목포시": [
      "대성동", "동명동", "만호동", "목원동", "부주동", "부흥동", "북항동", "산정동", "삼학동", "삼향동", "상동",
      "신흥동", "연동", "연산동", "옥암동", "용당1동", "용당2동", "용해동", "원산동", "유달동", "이로동", "죽교동",
      "하당동"
    ],
    "전남_무안군": [
      "망운면", "몽탄면", "무안읍", "삼향읍", "운남면", "일로읍", "청계면", "해제면", "현경면"
    ],
    "전남_보성군": [
      "겸백면", "노동면", "득량면", "문덕면", "미력면", "벌교읍", "보성읍", "복내면", "율어면", "응치면", "조성면",
      "회천면"
    ],
    "전남_순천시": [
      "낙안면", "남제동", "덕연동", "도사동", "매곡동", "별량면", "삼산동", "상사면", "서면", "송광면", "승주읍",
      "왕조1동", "왕조2동", "외서면", "월등면", "장천동", "저전동", "조곡동", "주암면", "중앙동", "풍덕동", "해룡면",
      "향동", "황전면"
    ],
    "전남_신안군": [
      "도초면", "비금면", "신의면", "안좌면", "암태면", "압해읍", "임자면", "자은면", "장산면", "증도면", "지도읍",
      "팔금면", "하의면", "흑산면"
    ],
    "전남_여수시": [
      "광림동", "국동", "남면", "대교동", "돌산읍", "동문동", "둔덕동", "만덕동", "묘도동", "문수동", "미평동",
      "삼산면", "삼일동", "서강동", "소라면", "시전동", "쌍봉동", "여서동", "여천동", "월호동", "율촌면", "주삼동",
      "중앙동", "충무동", "한려동", "화양면", "화정면"
    ],
    "전남_영광군": [
      "군남면", "군서면", "낙월면", "대마면", "묘량면", "백수읍", "법성면", "불갑면", "염산면", "영광읍", "홍농읍"
    ],
    "전남_영암군": [
      "군서면", "금정면", "덕진면", "도포면", "미암면", "삼호읍", "서호면", "시종면", "신북면", "영암읍", "학산면"
    ],
    "전남_완도군": [
      "고금면", "군외면", "금당면", "금일읍", "노화읍", "보길면", "생일면", "소안면", "신지면", "약산면", "완도읍",
      "청산면"
    ],
    "전남_장성군": [
      "남면", "동화면", "북이면", "북일면", "북하면", "삼계면", "삼서면", "서삼면", "장성읍", "진원면", "황룡면"
    ],
    "전남_장흥군": [
      "관산읍", "대덕읍", "부산면", "안양면", "용산면", "유치면", "장동면", "장평면", "장흥읍", "회진면"
    ],
    "전남_진도군": [
      "고군면", "군내면", "의신면", "임회면", "조도면", "지산면", "진도읍"
    ],
    "전남_함평군": [
      "나산면", "대동면", "손불면", "신광면", "엄다면", "월야면", "학교면", "함평읍", "해보면"
    ],
    "전남_해남군": [
      "계곡면", "마산면", "문내면", "북일면", "북평면", "산이면", "삼산면", "송지면", "옥천면", "해남읍", "현산면",
      "화산면", "화원면", "황산면"
    ],
    "전남_화순군": [
      "능주면", "도곡면", "도암면", "동면", "동복면", "백아면", "사평면", "이서면", "이양면", "청풍면", "춘양면",
      "한천면", "화순읍"
    ],
    
    "경북_경산시": [
      "남부동", "남산면", "남천면", "동부동", "북부동", "서부1동", "서부2동", "압량읍", "와촌면", "용성면", "자인면",
      "중방동", "중앙동", "진량읍", "하양읍"
    ],
    "경북_경주시": [
      "감포읍", "강동면", "건천읍", "내남면", "동천동", "문무대왕면", "보덕동", "불국동", "산내면", "서면", "선도동",
      "성건동", "안강읍", "양남면", "외동읍", "용강동", "월성동", "중부동", "천북면", "현곡면", "황남동", "황성동",
      "황오동"
    ],
    "경북_고령군": [
      "개진면", "다산면", "대가야읍", "덕곡면", "성산면", "쌍림면", "우곡면", "운수면"
    ],
    "경북_구미시": [
      "고아읍", "공단동", "광평동", "도개면", "도량동", "무을면", "비산동", "산동읍", "상모사곡동", "선산읍",
      "선주원남동", "송정동", "신평1동", "신평2동", "양포동", "옥성면", "원평동", "인동동", "임오동", "장천면",
      "지산동", "진미동", "해평면", "형곡1동", "형곡2동"
    ],
    "경북_김천시": [
      "감문면", "감천면", "개령면", "구성면", "남면", "농소면", "대곡동", "대덕면", "대신동", "대항면", "봉산면",
      "부항면", "아포읍", "양금동", "어모면", "율곡동", "자산동", "조마면", "증산면", "지례면", "지좌동", "평화남산동"
    ],
    "경북_문경시": [
      "문경읍", "가은읍", "영순면", "산양면", "호계면", "산북면", "동로면", "마성면", "농암면", "점촌1동", "점촌2동",
      "점촌3동", "점촌4동", "점촌5동"
    ],
    "경북_봉화군": [
      "명호면", "물야면", "법전면", "봉성면", "봉화읍", "상운면", "석포면", "소천면", "재산면", "춘양면"
    ],
    "경북_상주시": [
      "계림동", "공검면", "공성면", "낙동면", "남원동", "내서면", "동문동", "동성동", "모동면", "모서면", "북문동",
      "사벌국면", "신흥동", "외남면", "외서면", "은척면", "이안면", "중동면", "청리면", "함창읍", "화남면", "화동면",
      "화북면", "화서면"
    ],
    "경북_성주군": [
      "가천면", "금수면", "대가면", "벽진면", "선남면", "성주읍", "수륜면", "용암면", "월항면", "초전면"
    ],
    "경북_안동시": [
      "강남동", "길안면", "남선면", "남후면", "녹전면", "도산면", "명륜동", "북후면", "서구동", "서후면", "송하동",
      "안기동", "예안면", "옥동", "와룡면", "용상동", "일직면", "임동면", "임하면", "중구동", "태화동", "평화동",
      "풍산읍", "풍천면"
    ],
    "경북_영덕군": [
      "강구면", "남정면", "달산면", "병곡면", "영덕읍", "영해면", "지품면", "창수면", "축산면"
    ],
    "경북_영양군": [
      "석보면", "수비면", "영양읍", "일월면", "입암면", "청기면"
    ],
    "경북_영주시": [
      "가흥1동", "가흥2동", "단산면", "문수면", "봉현면", "부석면", "상망동", "순흥면", "안정면", "영주1동", "영주2동",
      "이산면", "장수면", "평은면", "풍기읍", "하망동", "휴천1동", "휴천2동", "휴천3동"
    ],
    "경북_영천시": [
      "고경면", "금호읍", "남부동", "대창면", "동부동", "북안면", "서부동", "신녕면", "완산동", "임고면", "자양면",
      "중앙동", "청통면", "화남면", "화북면", "화산면"
    ],
    "경북_예천군": [
      "감천면", "개포면", "보문면", "예천읍", "용궁면", "용문면", "유천면", "은풍면", "지보면", "풍양면", "호명면",
      "효자면"
    ],
    "경북_울릉군": [
      "북면", "서면", "울릉읍"
    ],
    "경북_울진군": [
      "근남면", "금강송면", "기성면", "매화면", "북면", "온정면", "울진읍", "죽변면", "평해읍", "후포면"
    ],
    "경북_의성군": [
      "가음면", "구천면", "금성면", "다인면", "단밀면", "단북면", "단촌면", "봉양면", "비안면", "사곡면", "신평면",
      "안계면", "안사면", "안평면", "옥산면", "의성읍", "점곡면", "춘산면"
    ],
    "경북_청도군": [
      "각남면", "각북면", "금천면", "매전면", "운문면", "이서면", "청도읍", "풍각면", "화양읍"
    ],
    "경북_청송군": [
      "부남면", "안덕면", "주왕산면", "진보면", "청송읍", "파천면", "현동면", "현서면"
    ],
    "경북_칠곡군": [
      "가산면", "기산면", "동명면", "북삼읍", "석적읍", "약목면", "왜관읍", "지천면"
    ],
    "경북_포항시": [
      "남구", "북구"
    ],

    "경남_거제시": [
      "거제면", "고현동", "남부면", "능포동", "동부면", "둔덕면", "사등면", "상문동", "수양동", "아주동", "연초면",
      "옥포1동", "옥포2동", "일운면", "장목면", "장승포동", "장평동", "하청면"
    ],
    "경남_거창군": [
      "가북면", "가조면", "거창읍", "고제면", "남상면", "남하면", "마리면", "북상면", "신원면", "웅양면", "위천면",
      "주상면"
    ],
    "경남_고성군": [
      "개천면", "거류면", "고성읍", "구만면", "대가면", "동해면", "마암면", "삼산면", "상리면", "영오면", "영현면",
      "하이면", "하일면", "회화면"
    ],
    "경남_김해시": [
      "내외동", "대동면", "동상동", "부원동", "북부동", "불암동", "삼안동", "상동면", "생림면", "장유1동", "장유2동",
      "장유3동", "주촌면", "진례면", "진영읍", "칠산서부동", "한림면", "활천동", "회현동"
    ],
    "경남_남해군": [
      "고현면", "남면", "남해읍", "미조면", "삼동면", "상주면", "서면", "설천면", "이동면", "창선면"
    ],
    "경남_밀양시": [
      "가곡동", "교동", "내이동", "내일동", "단장면", "무안면", "부북면", "산내면", "산외면", "삼랑진읍", "삼문동",
      "상남면", "상동면", "청도면", "초동면", "하남읍"
    ],
    "경남_사천시": [
      "곤명면", "곤양면", "남양동", "동서금동", "동서동", "벌용동", "사남면", "사천읍", "서포면", "선구동", "용현면",
      "정동면", "축동면", "향촌동"
    ],
    "경남_산청군": [
      "산청읍", "차황면", "오부면", "생초면", "금서면", "삼장면", "시천면", "단성면", "신안면", "생비량면", "신등면"
    ],
    "경남_양산시": [
      "강서동", "덕계동", "동면", "물금읍", "삼성동", "상북면", "서창동", "소주동", "양주동", "원동면", "중앙동",
      "평산동", "하북면"
    ],
    "경남_의령군": [
      "가례면", "궁류면", "낙서면", "대의면", "봉수면", "부림면", "용덕면", "유곡면", "의령읍", "정곡면", "지정면",
      "칠곡면", "화정면"
    ],
    "경남_진주시": [
      "가호동", "금곡면", "금산면", "내동면", "대곡면", "대평면", "명석면", "문산읍", "미천면", "사봉면", "상대동",
      "상봉동", "상평동", "성북동", "수곡면", "신안동", "이반성면", "이현동", "일반성면", "정촌면", "중앙동", "지수면",
      "진성면", "집현면", "천전동", "초장동", "충무공동", "판문동", "평거동", "하대동"
    ],
    "경남_창녕군": [
      "계성면", "고암면", "길곡면", "남지읍", "대지면", "대합면", "도천면", "부곡면", "성산면", "영산면", "유어면",
      "이방면", "장마면", "창녕읍"
    ],
    "경남_창원시": [
      "마산합포구", "마산회원구", "성산구", "의창구", "진해구"
    ],
    "경남_통영시": [
      "광도면", "도산면", "도천동", "명정동", "무전동", "미수동", "봉평동", "북신동", "사량면", "산양읍", "욕지면",
      "용남면", "정량동", "중앙동", "한산면"
    ],
    "경남_하동군": [
      "하동읍", "화개면", "악양면", "적량면", "횡천면", "고전면", "금남면", "금성면", "진교면", "양보면", "북천면",
      "청암면", "옥종면"
    ],
    "경남_함안군": [
      "가야읍", "군북면", "대산면", "법수면", "산인면", "여항면", "칠북면", "칠서면", "칠원읍", "함안면"
    ],
    "경남_함양군": [
      "마천면", "백전면", "병곡면", "서상면", "서하면", "수동면", "안의면", "유림면", "지곡면", "함양읍", "휴천면"
    ],
    "경남_합천군": [
      "가야면", "가회면", "대병면", "대양면", "덕곡면", "묘산면", "봉산면", "삼가면", "쌍백면", "쌍책면", "야로면",
      "용주면", "율곡면", "적중면", "청덕면", "초계면", "합천읍"
    ],
    
    "제주_서귀포시": [
      "남원읍", "대륜동", "대정읍", "대천동", "동홍동", "서홍동", "성산읍", "송산동", "안덕면", "영천동", "예래동",
      "정방동", "중문동", "중앙동", "천지동", "표선면", "효돈동"
    ],
    "제주_제주시": [
      "건입동", "구좌읍", "노형동", "도두동", "봉개동", "삼도1동", "삼도2동", "삼양동", "아라동", "애월읍", "연동",
      "오라동", "외도동", "용담1동", "용담2동", "우도면", "이도1동", "이도2동", "이호동", "일도1동", "일도2동",
      "조천읍", "추자면", "한경면", "한림읍", "화북동"
    ]
  ]
}
